var files = {

    "1850": [
        "\\1850\\1.png"
    ],
    "1890": [
        "\\1890\\2.png",
        "\\1890\\3.png",
        "\\1890\\4.png"
    ],
    "1901": [
        "\\1901\\5.png",
        "\\1901\\6.png"
    ],
    "1902": [
        "\\1902\\7.png"
    ],
    "1907": [
        "\\1907\\8.png"
    ],
    "1908": [
        "\\1908\\10.png",
        "\\1908\\9.png"
    ],
    "1910": [
        "\\1910\\11.png"
    ],
    "1926": [
        "\\1926\\12.png",
        "\\1926\\13.png",
        "\\1926\\14.png",
        "\\1926\\15.png",
        "\\1926\\16.png"
    ],
    "1931": [
        "\\1931\\17.png",
        "\\1931\\18.png",
        "\\1931\\19.png",
        "\\1931\\20.png",
        "\\1931\\21.png",
        "\\1931\\22.png",
        "\\1931\\23.png",
        "\\1931\\25.png"
    ],
    "1938": [
        "\\1938\\26.png",
        "\\1938\\27.png",
        "\\1938\\28.png",
        "\\1938\\29.png",
        "\\1938\\30.png",
        "\\1938\\31.png",
        "\\1938\\32.png",
        "\\1938\\33.png",
        "\\1938\\34.png",
        "\\1938\\35.png",
        "\\1938\\38.png",
        "\\1938\\39.png",
        "\\1938\\40.png",
        "\\1938\\41.png"
    ],
    "2023": [
        "\\2023\\0.png",
        "\\2023\\1.png",
        "\\2023\\10.png",
        "\\2023\\100.png",
        "\\2023\\101.png",
        "\\2023\\102.png",
        "\\2023\\103.png",
        "\\2023\\104.png",
        "\\2023\\105.png",
        "\\2023\\106.png",
        "\\2023\\107.png",
        "\\2023\\11.png",
        "\\2023\\12.png",
        "\\2023\\13.png",
        "\\2023\\14.png",
        "\\2023\\15.png",
        "\\2023\\16.png",
        "\\2023\\17.png",
        "\\2023\\18.png",
        "\\2023\\19.png",
        "\\2023\\2.png",
        "\\2023\\20.png",
        "\\2023\\21.png",
        "\\2023\\22.png",
        "\\2023\\23.png",
        "\\2023\\24.png",
        "\\2023\\25.png",
        "\\2023\\26.png",
        "\\2023\\27.png",
        "\\2023\\28.png",
        "\\2023\\29.png",
        "\\2023\\3.png",
        "\\2023\\30.png",
        "\\2023\\31.png",
        "\\2023\\32.png",
        "\\2023\\33.png",
        "\\2023\\34.png",
        "\\2023\\35.png",
        "\\2023\\36.png",
        "\\2023\\37.png",
        "\\2023\\38.png",
        "\\2023\\39.png",
        "\\2023\\4.png",
        "\\2023\\40.png",
        "\\2023\\41.png",
        "\\2023\\42.png",
        "\\2023\\43.png",
        "\\2023\\44.png",
        "\\2023\\45.png",
        "\\2023\\46.png",
        "\\2023\\47.png",
        "\\2023\\48.png",
        "\\2023\\49.png",
        "\\2023\\5.png",
        "\\2023\\50.png",
        "\\2023\\51.png",
        "\\2023\\52.png",
        "\\2023\\53.png",
        "\\2023\\54.png",
        "\\2023\\55.png",
        "\\2023\\56.png",
        "\\2023\\57.png",
        "\\2023\\58.png",
        "\\2023\\59.png",
        "\\2023\\6.png",
        "\\2023\\60.png",
        "\\2023\\64.png",
        "\\2023\\65.png",
        "\\2023\\66.png",
        "\\2023\\67.png",
        "\\2023\\69.png",
        "\\2023\\7.png",
        "\\2023\\8.png",
        "\\2023\\80.png",
        "\\2023\\82.png",
        "\\2023\\83.png",
        "\\2023\\84.png",
        "\\2023\\88.png",
        "\\2023\\9.png",
        "\\2023\\90.png",
        "\\2023\\91.png",
        "\\2023\\92.png",
        "\\2023\\93.png",
        "\\2023\\94.png",
        "\\2023\\95.png",
        "\\2023\\96.png",
        "\\2023\\97.png",
        "\\2023\\98.png",
        "\\2023\\99.png"
    ]
};

var introduction = {

    "\\1850\\1.png": "这张照片是上海西门“仪凤门”\n初设城门6座，其中于肇嘉浜及\n其北边道路与城墙及其西沿城壕的十字交叉处，设一城门，初名仪凤门，因其位于城垣西缘，故习称西门。 后又因新辟尚文门 (小西门)而改称老西门至今。 清末的老西门前身——上海县凤仪门 参考阅读： 沪说 | 早朝宗，夕仪凤，而今飞到横泾边：上海县城及城门小史 清乾隆年间与同治年间，上海老城厢道路对比，原先路网稀疏的仪凤门一带，道路明显增加了。 （来源：上海历史地图集） “上海之最”不胜枚举之地 老西门的地域面积为1.24平方公里，不算大，但拥有“上海之最”可谓不胜枚举。 如上海市区唯一的儒教圣地文庙，又称“孔庙”，是上海市区唯一的一座祭祀孔子的古代建筑群，也是老城厢著名的现存名胜古迹之一，已有七百多年历史。 这里曾诞生了敬业、龙门、梅溪、蕊珠等闻名上海的四大书院。",
    "\\1890\\2.png": "街头的一辆载人的黄包车。",
    "\\1890\\3.png": "上海虹口菜市场成立于1890年，是上海历史悠久的传统菜市场之一。\n虹口菜市场位于上海市虹口区，地理位置便利，交通便捷。\n虹口菜市场是一个综合性的农副产品市场，提供各种新鲜的蔬菜、水果、肉类、海鲜等商品。市场内的摊位琳琅满目，货品丰富多样，消费者可以在这里找到几乎所有需要的食材。\n菜市场的环境整洁卫生，设施齐全。为了方便顾客购物，市场内设置有宽敞明亮的走廊和摊位，顾客可以舒适地选择所需商品。此外，菜市场还设有称重设备和支付设施，以方便顾客购买商品。\n虹口菜市场除了提供新鲜的食材外，还有一些小吃摊位和餐馆。顾客在购物之余，可以品尝到当地的特色美食，体验不同的口味。\n作为上海市的传统菜市场，虹口菜市场秉承着悠久的历史和丰富的文化底蕴。它不仅是居民购买食材的重要场所，也是一个展示当地市井文化和生活氛围的地方。",
    "\\1901\\5.png": "耶稣会孤儿院里晨读的孤儿",
    "\\1901\\6.png": "耶稣会孤儿院里晨读的孤儿",
    "\\1901\\6.png": "在消费水管前挑水的百姓。请注意，左边坐着的是自来水管理工",
    "\\1902\\7.png": "万国商团行走在南京路上，参加游行检阅。自行车当时是罕见品，注意右边的龙旗",
    "\\1907\\8.png": "英商上海电力公司雇佣工人在南京路上铺设电车轨道。\n这是上海第一条有轨电车，从静安寺到上海总会，全长6.04千米。",
    "\\1908\\9.png": "第一条有轨电车路线在公共租界开始运行",
    "\\1908\\10.png": "怡和洋行的主要管理和上海地方官员参加沪宁铁路全线通车典礼",
    "\\1910\\11.png": "上海外滩，万国建筑群已经成型",
    "\\1926\\12.png": "这张所拍的位置，据考证应该是“德国总会”楼上的瞭望亭，大楼1907年由德国人建成，\n此楼为意大利巴洛克式建筑风格，为上海外滩最为华丽的西式建筑，可惜第一次世界大战后，德国战败，\n此楼被中国银行收购，后拆毁于1937年建成至今，原楼也只能在照片中永存了",
    "\\1926\\13.png": "一对船民夫妻，小舟上满载货物，两人相互配合，女子在船头操控摇橹，丈夫在船尾撑篙，配合默契",
    "\\1926\\14.png": "南京东路和外滩交汇处的路口，一位印度阿三巡查正在执勤，只见他大腹便便，满脸络腮胡，头带包巾，\n这个瞬间见证了租界的这段屈辱历史。背后是和平饭店南楼，墙根荫凉处，一位西装外国人和一长衫中国人正在交谈。其他路人匆匆而过。",
    "\\1926\\15.png": "欧战胜利纪念碑，也叫和平女神碑，是当时租界工部局为纪念第一次世界大战协约国胜利而建造，\n1924年落成，与如今的气象信号台相邻，1941年日本占领期间，被日军故意拆毁",
    "\\1926\\16.png": "上海海关大楼前的栈桥，此时的海关大楼正在原址拆除重建，江边的栈桥上站满了商人，翘首以待，业务繁忙，\n栈桥背后的左起建筑是华俄道胜银行，后成为民 国 中央银行所在，如今是中国外汇交易中心。\n中间的高楼为上海第一幢高楼《字林西报》大楼，现为友邦保险大楼",
    "\\1931\\17.png": "位于虹口的食品市场，因上海生活的外国人达几十国，这里因此也汇聚了来自世界各地的食材",
    "\\1931\\18.png": "外滩鸟瞰，拍摄位置可能在气息信号台上所拍，此时的上海，西式建筑林立，道路宽敞，\n小轿车众多，码头处处，舟船往来者众。一派繁华之像",
    "\\1931\\19.png": "上海河南路的街景，不宽的道路，黄包车来回拉客，两旁商铺大多做的是绸缎生意，\n绸质旗帜挑入空中，大减价，大赠品促销不断，几乎都有着喜幛二字，\n那是因为旧中国，人们在祝贺新婚时，都会买上绸缎，上面附以贺联，祝贺主家",
    "\\1931\\20.png": "上海法国租界，路口人来人往，煞是热闹，街门上方一圈广告是：\n方九霞银楼，这是旧上海九大银楼之一，里边有宝大祥布庄，恒丰绸缎行",
    "\\1931\\21.png": "俯瞰黄浦江，江面宽阔，一艘巨轮正在迎面驶来，大小船舶穿行繁忙，浦江在这里拐了一道大弯，\n右边的陆地正是当下的陆家嘴，八十多年的时光，悠悠而过，如白驹过隙，\n当时的人们，谁也不会想到如今摩天高楼林立，竟已如此繁华",
    "\\1931\\22.png": "四马路青莲阁茶楼，楼分上下两层，楼下则是一处游乐场，表演唱曲杂耍，\n楼上喝茶观赏，是老上海著名的三教九流汇聚之所",
    "\\1931\\23.png": "城隍庙内豫园湖心亭，豫园始建于明朝嘉靖三十八年（公元1559年），由当时的刑部尚书潘恩之子潘允端在其家宅附近所造，\n而湖心亭则建于清乾隆年间，咸丰年间成为茶馆，百姓通过九曲桥游览豫园，同时在亭楼上休憩饮茶，观景之余，惬意无比",
    "\\1931\\25.png": "城隍庙湖心亭附近的鸟市场。各式鸟笼层层叠叠挂满铺面",
    "\\1938\\26.png": "上海南京路的街头夜色，车光如流，灯光璀璨，永安百货公司的招牌清晰可辨",
    "\\1938\\27.png": "位于江湾的上海市政府大楼，1933年建成，有著名建筑设计师董大酉按照传统宫殿的形式设计，现为上海市体育学院。图中已经被炮火损毁多处",
    "\\1938\\28.png": "日本信奉招魂文化，在上海所建的神社，门口更是停着一辆坦克，耀武扬威，\n为其侵华战争中死亡的军人招魂所用，其不仅活人欲占领中国，死人也想在中国安定，实在是欺人太甚。此处后来抗战胜利，被国人捣毁",
    "\\1938\\29.png": "此图近处的西式建筑为俄罗斯总领馆，由德国人设计，巴洛克建筑风格，\n1916年12月建成至今。苏州河与黄浦江交汇处的陆地，那时为绿地公园，如今是上海市人民英雄纪念塔的位置",
    "\\1938\\30.png": "是俄罗斯总领馆上俯瞰，下方为外白渡桥跨过苏州河。河下舟船鱼贯出入",
    "\\1938\\31.png": "北四川路（武进路以北）的一处转角，四层楼上赫然飘扬着日本海军旗，\n此处为侵华日军海军陆战队在上海的驻地。正是日本侵华的历史见证，每个人中国人如果不想遭受这样的屈辱，都当自强报国",
    "\\1938\\32.png": "南京路上，有轨电车，小汽车，黄包车、自行车各行其道，电车上清晰可见“可口可乐”的广告",
    "\\1938\\33.png": "吴淞路口，一位小女孩背着书包，歪着头看着，很是可爱。前方店铺的门楣写着“至诚当铺”",
    "\\1938\\34.png": "在外滩上巡逻的英国士兵",
    "\\1938\\35.png": "外滩近景，各国洋行，都高高飘扬着异国国旗，一排轿车停在路旁",
    "\\1938\\38.png": "苏州河畔，外白渡桥横跨两岸，各种民船停泊河内，除了运输或打鱼，主要就在船上生活",
    "\\1938\\39.png": "赛犬场，当时的人们除了竞马，还有以赛狗的活动，通过下注博彩，可见当时的奢靡之风",
    "\\1938\\40.png": "远瞰公共租界。一排排房屋整齐相邻，屋檐的曲线如同波浪般，连绵至远方",
    "\\1938\\41.png": "租界西边静安寺路的一处公园，池畔杨柳低垂，波光粼粼，风景虽好，却是亡国之所",
    
}
$(document).ready(function () {
    var timeline = $("#line");
    var tooltip = $("#tooltip");

    timeline.click(function (event) {
        var timelineWidth = timeline.width();
        var mouseX = event.pageX - timeline.offset().left;
        var startYear = 1850;
        var endYear = 2023;
        var timelineDuration = endYear - startYear;
        var currentYear = startYear + Math.round((mouseX / timelineWidth) * timelineDuration);

        var closestYear = Object.keys(files).reduce(function (a, b) {
            return Math.abs(b - currentYear) < Math.abs(a - currentYear) ? b : a;
        });

        var fileList = files[closestYear];
        var randomFile = fileList[Math.floor(Math.random() * fileList.length)];
        $("#show").removeClass("moveLeft");
        $("#show").addClass("moveRight");

        $("#image").attr("src", ".\\素材" + randomFile);

        $("#date").text("拍摄于"+closestYear);

        $("#introduction").text("");
        var i = 0;
        if (closestYear == 2023)
        {
            var timer = setInterval(function () {
                $("#introduction").append("这是现代上海的照片，可见上海的繁荣景象".charAt(i));
                i++;
                if (i == "这是现代上海的照片，可见上海的繁荣景象".length) {
                    clearInterval(timer);
                }
            }, 50);
        }
        else
        {
            var timer = setInterval(function () {
                $("#introduction").append(introduction[randomFile].charAt(i));
                i++;
                if (i == introduction[randomFile].length) {
                    clearInterval(timer);
                }
            }, 10);
        }

    });

    timeline.mousemove(function (event) {
        var timelineWidth = timeline.width();
        var mouseX = event.pageX - timeline.offset().left;
        var startYear = 1850;
        var endYear = 2023;
        var timelineDuration = endYear - startYear;
        var currentYear = startYear + Math.round((mouseX / timelineWidth) * timelineDuration);

        tooltip.removeClass("hide");

        tooltip.text("" + currentYear);
        tooltip.css({ marginTop: '1%', marginLeft: event.pageX - 23 + 'px' }).show();
    });

    timeline.mouseleave(function () {
        tooltip.addClass("hide");
    });
});

var tooltip = $("#tooltip");
tooltip.hide();

// 定义一个添加id=show的元素的hide的class的函数
function hideShow() {
    $("#show").addClass("moveLeft");
}

